Manoharkuduchella/Manohar_BitLearn/Bitlearn_workspace/Microcontrollers/STM32/stm32l4_workspace_hal/12_HAL_UART_MemToMem_DMA/Src/main.c
#include<stdio.h>
#include "stm32l4xx_hal.h"
#include "stm32l4xx_hal_rcc.h"

#define BUFFER_SIZE  				32
#define DMA_CHANNEL					DMA1_Channel5
#define DMA_CHANNEL_IRQ				DMA1_Channel5_IRQn
#define DMA_CHANNEL_IRQHANDLER		DMA1_CH5_IRQHandler
#define DMA_MUX_STREAM 				DMA_REQUEST_2

void SysTick_Handler(void);
void uart1_init(void);

DMA_HandleTypeDef DmaHandle;

static const uint32_t aSRC_Const_Buffer[BUFFER_SIZE] = {
					1,2,3,4,
					5,6,7,8,
					9,10,11,12,
					13,14,15,16,
					17,18,19,20,
					21,22,23,24,
					25,26,27,28,
					29,30,31,32
};

static uint32_t aDST_Buffer[BUFFER_SIZE];

static void TrasferComplete(DMA_HandleTypeDef *DmaHandle);
static void TransferError(DMA_HandleTypeDef *DmaHandle);
static void dma_config(void);


UART_HandleTypeDef huart2;

int __io_putchar(int ch)
{
	HAL_UART_Transmit(&huart2,(uint8_t*)&ch,1,10);
	return ch;

}


int main() {
	HAL_Init();
	uart1_init();

	dma_config();

	while (1) {
	}
}

void SysTick_Handler(void) {
	HAL_IncTick();
}


static void dma_config(void)
{
	//Enable DMA1 module clock access
	__HAL_RCC_DMA1_CLK_ENABLE();

	DmaHandle.Instance = DMA_CHANNEL;
	DmaHandle.Init.Request = DMA_MUX_STREAM;
	DmaHandle.Init.Mode = DMA_NORMAL;
	DmaHandle.Init.Direction = DMA_MEMORY_TO_MEMORY;
	DmaHandle.Init.MemInc = DMA_MINC_ENABLE;
	DmaHandle.Init.PeriphInc = DMA_PINC_ENABLE;
	DmaHandle.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
	DmaHandle.Init.MemDataAlignment = DMA_MDATAALIGN_WORD;
	DmaHandle.Init.Priority = DMA_PRIORITY_HIGH;

	HAL_DMA_Init(&DmaHandle);

	//Register Call-backs Functions
	HAL_DMA_RegisterCallback(&DmaHandle, HAL_DMA_XFER_CPLT_CB_ID, TrasferComplete);
	HAL_DMA_RegisterCallback(&DmaHandle, HAL_DMA_XFER_ERROR_CB_ID, TransferError);

	HAL_NVIC_SetPriority(DMA_CHANNEL_IRQ, 0, 0);
	HAL_NVIC_EnableIRQ(DMA_CHANNEL_IRQ);

	HAL_DMA_Start_IT(&DmaHandle, (uint32_t)aSRC_Const_Buffer, (uint32_t)aDST_Buffer, BUFFER_SIZE);

}

static void TrasferComplete(DMA_HandleTypeDef *DmaHandle)
{
	printf("Transfer Complete!! \n\r");
}

static void TransferError(DMA_HandleTypeDef *DmaHandle)
{
	printf("Transfer Error!! \n\r");
}

void DMA_CHANNEL_IRQHANDLER(void)
{
	HAL_DMA_IRQHandler(&DmaHandle);
}

void uart1_init(void) {

	GPIO_InitTypeDef GPIO_InitStruct = { 0 };
	//enable UART pins clock access
	__HAL_RCC_GPIOA_CLK_ENABLE();

	//Enable UART module clock access
	__HAL_RCC_USART2_CLK_ENABLE();

	//Configure pins to act as alternate func pins(UART)
	GPIO_InitStruct.Pin = GPIO_PIN_2 | GPIO_PIN_3;
	GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	GPIO_InitStruct.Alternate = GPIO_AF7_USART2;
	//GPIO_AF7_USART3
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;

	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

	//configure UART module
	huart2.Instance = USART2;
	huart2.Init.BaudRate = 9600;
	huart2.Init.WordLength = UART_WORDLENGTH_8B;
	huart2.Init.StopBits = UART_STOPBITS_1;
	huart2.Init.Parity = UART_PARITY_NONE;
	huart2.Init.Mode = UART_MODE_TX_RX;
	huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
	huart2.Init.OverSampling = UART_OVERSAMPLING_16;
	//HwFlowCtl and Oversampling not present

	HAL_UART_Init(&huart2);

}


